20260115075624-peer_reviews.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-01-31 Sat 14:00 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Peer Reviews</title>
<meta name="author" content="Michael Leibbrandt" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Peer Reviews</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orged36dfe">1. Feed-forward:</a>
<ul>
<li><a href="#org31d2669">1.1. Feed-forward feedback examples</a></li>
<li><a href="#org616e473">1.2. Not feed-forward feedback examples</a></li>
</ul>
</li>
<li><a href="#orgf1c15a6">2. Actionable:</a>
<ul>
<li><a href="#orgaf7586c">2.1. Actionable feedback examples</a></li>
<li><a href="#org50d0801">2.2. Not actionable feedback examples</a></li>
</ul>
</li>
<li><a href="#org88d57e1">3. Succinct:</a></li>
<li><a href="#org4e1addf">4. Timely:</a>
<ul>
<li><a href="#orgffc12c8">4.1. Timely feedback example</a></li>
<li><a href="#orga7581e6">4.2. Somewhat timely feedback example</a></li>
<li><a href="#org69a8e65">4.3. Not timely feedback example</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
The framework outlined below is a great guide on how to provide constructive feedback for peer review assignments on Coursera.
</p>

<p>
Providing strong feedback will help to encourage a culture of strong feedback!
</p>

<p>
<b>F.A.S.T</b> feedback
Strong feedback has 4 characteristics:
</p>

<ul class="org-ul">
<li>Feed-forward</li>
<li>Actionable</li>
<li>Succinct</li>
<li>Timely</li>
</ul>

<p>
A note about tone: Begin your feedback with at least one positive comment.
</p>

<p>
Be respectful and constructive by starting out with positive feedback before giving your critical feedback.
</p>

<div id="outline-container-orged36dfe" class="outline-2">
<h2 id="orged36dfe"><span class="section-number-2">1.</span> Feed-forward:</h2>
<div class="outline-text-2" id="text-1">
<p>
Feed-forward feedback tells learners how your feedback will help them succeed in future assignments or reach their goals related to what is coming up in class.
Feed-forward feedback is focused on goals and the future. That’s why it’s important to give learners a forward reference point.
</p>
</div>

<div id="outline-container-org31d2669" class="outline-3">
<h3 id="org31d2669"><span class="section-number-3">1.1.</span> Feed-forward feedback examples</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Implementing this feedback will help you do better on the next peer review assignment.</li>
<li>Making these changes will help you code faster, so you will be a more efficient programmer.</li>
</ul>
</div>
</div>

<div id="outline-container-org616e473" class="outline-3">
<h3 id="org616e473"><span class="section-number-3">1.2.</span> Not feed-forward feedback examples</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>Think about this feedback carefully.</li>
<li>You should make these changes.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgf1c15a6" class="outline-2">
<h2 id="orgf1c15a6"><span class="section-number-2">2.</span> Actionable:</h2>
<div class="outline-text-2" id="text-2">
<p>
Feedback should be specific, useful, and provide actionable information.
</p>

<p>
For example, saying “good job!” or “you didn’t follow the instructions” are not actionable or useful.
</p>

<p>
What specifically should the learner do more or less of next time?
</p>

<p>
It might help to cite specific content from the learner’s submission.
</p>
</div>

<div id="outline-container-orgaf7586c" class="outline-3">
<h3 id="orgaf7586c"><span class="section-number-3">2.1.</span> Actionable feedback examples</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>I like how you answered the question in two paragraphs, as the instructions asked for. One way to improve it can be….</li>
<li>Please limit your answer to 2 paragraphs of 5-8 sentences each.</li>
<li>Your charts convey all the required information. It can be made more readable by changing the axis limits.</li>
<li>You commented on the business’s financial position but did not include supporting data. Include specific profitability and liquidity data to support your argument.</li>
</ul>
</div>
</div>
<div id="outline-container-org50d0801" class="outline-3">
<h3 id="org50d0801"><span class="section-number-3">2.2.</span> Not actionable feedback examples</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>Good job!</li>
<li>This is too long.</li>
<li>Your chart isn't very clear.</li>
<li>Your argument isn’t strong. It’s not very clear.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org88d57e1" class="outline-2">
<h2 id="org88d57e1"><span class="section-number-2">3.</span> Succinct:</h2>
<div class="outline-text-2" id="text-3">
<p>
Pick 2 or 3 key pieces of feedback that learners should focus on.
</p>

<p>
Change based on this feedback should make a significant, positive difference in their next draft.
</p>
</div>
</div>

<div id="outline-container-org4e1addf" class="outline-2">
<h2 id="org4e1addf"><span class="section-number-2">4.</span> Timely:</h2>
<div class="outline-text-2" id="text-4">
<p>
The sooner the feedback, the better.
</p>

<p>
Feedback should ideally be given within <b>one</b> day and no longer than <b>2</b> <b>days</b> <b>after submission</b>.
</p>
</div>

<div id="outline-container-orgffc12c8" class="outline-3">
<h3 id="orgffc12c8"><span class="section-number-3">4.1.</span> Timely feedback example</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li><b>Within</b> 1 day of submission</li>
</ul>
</div>
</div>
<div id="outline-container-orga7581e6" class="outline-3">
<h3 id="orga7581e6"><span class="section-number-3">4.2.</span> Somewhat timely feedback example</h3>
<div class="outline-text-3" id="text-4-2">
<ul class="org-ul">
<li>1-2 days <b>after</b> submission</li>
</ul>
</div>
</div>
<div id="outline-container-org69a8e65" class="outline-3">
<h3 id="org69a8e65"><span class="section-number-3">4.3.</span> Not timely feedback example</h3>
<div class="outline-text-3" id="text-4-3">
<ul class="org-ul">
<li>A week <b>after</b> submission</li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
